Autodesk.Revit.DB.Electrical.DistributionSysTypeSet
A set that contains DistributionSys types.

Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.Insert(Autodesk.Revit.DB.Electrical.DistributionSysType)
System.Int32
Insert the specified DistributionSys type into the set.
item: The DistributionSys type to be inserted into the set.
Returns: Returns whether the DistributionSys type was inserted into the set.

Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.ReverseIterator
Autodesk.Revit.DB.Electrical.DistributionSysTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.ForwardIterator
Autodesk.Revit.DB.Electrical.DistributionSysTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.Erase(Autodesk.Revit.DB.Electrical.DistributionSysType)
System.Int32
Removes a specified DistributionSys type from the set.
item: The DistributionSys type to be erased.
Returns: The number of DistributionSys types that were erased from the set.

Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.Contains(Autodesk.Revit.DB.Electrical.DistributionSysType)
System.Boolean
Tests for the existence of a DistributionSys type within the set.
item: The DistributionSys type to be searched for.
Returns: The Contains method returns True if the DistributionSys type is within the set, otherwise False.

Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.Clear
void
Removes every DistributionSys type from the set, rendering it empty.

Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.Size
System.Int32
get
Returns the number of DistributionSys types that are in the set.

Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.